Callum-Sinclair/nrf51_pi_house_monitor/nrf_pi_extention/BLE_central/ble_central_and_peripheral/experimental/ble_app_hrs_rscs_relay/main.c
static ble_rscs_t   m_rscs;                                                         /**< Main structure for the Running speed and cadence server module. */

/**@brief UUIDs which the central applications will scan for, and which will be advertised by the peripherals. */
static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_HEART_RATE_SERVICE,         BLE_UUID_TYPE_BLE},
                                   {BLE_UUID_RUNNING_SPEED_AND_CADENCE,  BLE_UUID_TYPE_BLE}};

#define UART_RECIEVE_IDLE  0
#define UART_RECIEVED_STX  1
#define UART_RECIEVED_0    2
#define UART_RECIEVED_ID   3
#define UART_TX_IDLE       0
#define UART_TX_BUSY       1
#define UART_STX 2 //packet_start
#define UART_ETX 3 //packet_end
static uint8_t uart_rx_status   = UART_RECIEVE_IDLE;
static uint8_t uart_tx_status   = UART_TX_IDLE;


/* Tempartature logging, readying for UART */
/**@brief Structure containing the Temparature measurement received from the peer
 *        This originates from a recieved RSC service packet. 
 */
typedef struct
{
    //bool     is_inst_stride_len_present;             /**< True if Instantaneous Stride Length is present in the measurement. */
    //bool     is_total_distance_present;              /**< True if Total Distance is present in the measurement. */
    bool     posative;  //is_running;                             /**< True if running, False if walking. */
    uint16_t temp;      //inst_speed;                             /**< Instantaneous Speed. */
    uint8_t  id;        //inst_cadence;                           /**< Instantaneous Cadence. */
    //uint16_t inst_stride_length;                     /**< Instantaneous Stride Length. */
    //uint32_t total_distance;                         /**< Total Distance. */
} temp_t;

#define TEMP_ID     inst_cadence
#define TEMP_TEMP   inst_speed
#define TEMP_POS    is_running

temp_t latest_temp[10];

// Pin used to trigger debug events
#define DEBUG_PIN         8
#define DEBUG_PIN_MASK    (1 << DEBUG_PIN)
void debug_pin_init(void)
{
    NRF_GPIO->PIN_CNF[DEBUG_PIN] = ((GPIO_PIN_CNF_DIR_Input      << GPIO_PIN_CNF_DIR_Pos) | \
                                    (GPIO_PIN_CNF_INPUT_Connect  << GPIO_PIN_CNF_INPUT_Pos) | \
                                    (GPIO_PIN_CNF_PULL_Pullup    << GPIO_PIN_CNF_PULL_Pos) | \
                                    (GPIO_PIN_CNF_SENSE_Disabled << GPIO_PIN_CNF_SENSE_Pos));
    NRF_GPIO->DIRCLR = DEBUG_PIN_MASK;
}

// Functions for controlling the LED on the PCB
#define INDICATE_LED_PIN  4
#define INDICATE_LED_MASK (1 << INDICATE_LED_PIN)
void indicate_led_init(void)
{
    NRF_GPIO->PIN_CNF[INDICATE_LED_PIN] = ((GPIO_PIN_CNF_DIR_Output << GPIO_PIN_CNF_DIR_Pos) | \
                                           (GPIO_PIN_CNF_DRIVE_H0H1 << GPIO_PIN_CNF_DRIVE_Pos));
    NRF_GPIO->DIRSET = INDICATE_LED_MASK;
    NRF_GPIO->OUTCLR = INDICATE_LED_MASK;
}
void indicate_led_on(void)
{
    NRF_GPIO->OUTSET = INDICATE_LED_MASK;
}
void indicate_led_off(void)
{
    NRF_GPIO->OUTCLR = INDICATE_LED_MASK;
}

// Function to request that thermometer "dev" turns on its led
void indicate_dev(uint8_t dev)
{
    m_ble_rsc_c.conn_handle = m_conn_handle_c[dev];
    ble_rscs_c_rsc_notif_enable(&m_ble_rsc_c);
}

/**@brief Function to handle asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing ASSERT call.
 * @param[in] p_file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}

/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**
 * @brief Parses advertisement data, providing length and location of the field in case
 *        matching data is found.
 *
 * @param[in]  Type of data to be looked for in advertisement data.
 * @param[in]  Advertisement report length and pointer to report.
 * @param[out] If data type requested is found in the data report, type data length and
 *             pointer to data will be populated here.
 *
 * @retval NRF_SUCCESS if the data type is found in the report.
 * @retval NRF_ERROR_NOT_FOUND if the data type could not be found.
 */
static uint32_t adv_report_parse(uint8_t type, data_t * p_advdata, data_t * p_typedata)
{
    uint32_t  index = 0;
    uint8_t * p_data;

    p_data = p_advdata->p_data;

    while (index < p_advdata->data_len)
    {
        uint8_t field_length = p_data[index];
        uint8_t field_type   = p_data[index+1];

        if (field_type == type)
        {
            p_typedata->p_data   = &p_data[index+2];
            p_typedata->data_len = field_length-1;
            return NRF_SUCCESS;
        }
        index += field_length + 1;
    }
    return NRF_ERROR_NOT_FOUND;
}


/**@brief Function to start scanning.
 */
static void scan_start(void)
{
    ret_code_t err_code;

    sd_ble_gap_scan_stop();

    err_code = sd_ble_gap_scan_start(&m_scan_param);
    // It is okay to ignore this error since we are stopping the scan anyway.
    if (err_code != NRF_ERROR_INVALID_STATE)
    {
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling File Data Storage events.
 *
 * @param[in] p_evt  Peer Manager event.
 * @param[in] cmd
 */
static void fds_evt_handler(fds_evt_t const * const p_evt)
{
    if (p_evt->id == FDS_EVT_GC)
    {
        //NRF_LOG_PRINTF("GC completed\n");
    }
}


/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;

    switch(p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
            break;

        case PM_EVT_LINK_SECURED:
            //NRF_LOG_PRINTF("Link secured. Role: %d. conn_handle: %d, Procedure: %d\r\n",
              //             ble_conn_state_role(p_evt->conn_handle),
              //             p_evt->conn_handle,
              //             p_evt->params.link_secured_evt.procedure);
            break;

        case PM_EVT_LINK_SECURE_FAILED:
            /** In some cases, when securing fails, it can be restarted directly. Sometimes it can
             *  be restarted, but only after changing some Security Parameters. Sometimes, it cannot
             *  be restarted until the link is disconnected and reconnected. Sometimes it is
             *  impossible, to secure the link, or the peer device does not support it. How to
             *  handle this error is highly application dependent. */
            switch (p_evt->params.link_secure_failed_evt.error)
            {
                case PM_SEC_ERROR_PIN_OR_KEY_MISSING:
                    // Rebond if one party has lost its keys.
                    err_code = pm_link_secure(p_evt->conn_handle, true);
                    if (err_code != NRF_ERROR_INVALID_STATE)
                    {
                        APP_ERROR_CHECK(err_code);
                    }
                    break;

                default:
                    break;
            }
            break;

