Callum-Sinclair/nrf51_pi_house_monitor/nrf_pi_extention/BLE_central/ble_central_and_peripheral/experimental/ble_app_hrs_rscs_relay/main.c
        case PM_EVT_STORAGE_FULL:
            // Run garbage collection on the flash.
            err_code = fds_gc();
            if (err_code != NRF_ERROR_BUSY)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case PM_EVT_ERROR_UNEXPECTED:
            // A likely fatal error occurred. Assert.
            APP_ERROR_CHECK(p_evt->params.error_unexpected_evt.error);
            break;

        case PM_EVT_PEER_DATA_UPDATED:
            break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
            APP_ERROR_CHECK_BOOL(false);
            break;

        case PM_EVT_ERROR_LOCAL_DB_CACHE_APPLY:
            // The local database has likely changed, send service changed indications.
            pm_local_database_has_changed();
            break;

        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
            break;

        case PM_EVT_SERVICE_CHANGED_INDICATION_SENT:
            break;
    }
}


/**@brief Handles events coming from  Running Speed and Cadence central module.
 */
static void rscs_c_evt_handler(ble_rscs_c_t * p_rscs_c, ble_rscs_c_evt_t * p_rscs_c_evt)
{
    switch (p_rscs_c_evt->evt_type)
    {
        case BLE_RSCS_C_EVT_DISCOVERY_COMPLETE:
        {
            ret_code_t err_code;

            //NRF_LOG_PRINTF("Running Speed and Cadence service discovered\r\n");

            // Initiate bonding.
            err_code = pm_link_secure(p_rscs_c->conn_handle, false);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }

            // Running speed cadence service discovered. Enable notifications.
            err_code = ble_rscs_c_rsc_notif_enable(p_rscs_c);
            APP_ERROR_CHECK(err_code);
        } break; // BLE_RSCS_C_EVT_DISCOVERY_COMPLETE:

        case BLE_RSCS_C_EVT_RSC_NOTIFICATION:
        {
            uint32_t        err_code;
            ble_rscs_meas_t rscs_measurment;

           // NRF_LOG_PRINTF("Speed      = %d\r\n", p_rscs_c_evt->params.rsc.inst_speed);
            latest_temp[p_rscs_c_evt->params.rsc.TEMP_ID].id        = p_rscs_c_evt->params.rsc.TEMP_ID;
            latest_temp[p_rscs_c_evt->params.rsc.TEMP_ID].posative  = p_rscs_c_evt->params.rsc.TEMP_POS;
            latest_temp[p_rscs_c_evt->params.rsc.TEMP_ID].temp      = p_rscs_c_evt->params.rsc.TEMP_TEMP;
            
            rscs_measurment.is_running                  = true;
            rscs_measurment.is_inst_stride_len_present  = false;
            rscs_measurment.is_total_distance_present   = false;

            rscs_measurment.inst_stride_length = 0;
            rscs_measurment.inst_cadence       = latest_temp[1].temp;
            rscs_measurment.inst_speed         = latest_temp[0].temp;
            rscs_measurment.total_distance     = latest_temp[2].temp;

            err_code = ble_rscs_measurement_send(&m_rscs, &rscs_measurment);
            if ((err_code != NRF_SUCCESS) &&
                (err_code != NRF_ERROR_INVALID_STATE) &&
                (err_code != BLE_ERROR_NO_TX_PACKETS) &&
                (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
                )
            {
                APP_ERROR_HANDLER(err_code);
            }
        } break; // BLE_RSCS_C_EVT_RSC_NOTIFICATION

        default:
            // No implementation needed.
            break;
    }
}


static void uart_data_rx_handler(void)
{
    uint8_t rx_ch           = 0;
    char    id_ch           = 0;
    uint8_t id_num          = 99;

    app_uart_get(&rx_ch);
    
    if ((rx_ch == UART_STX) && (uart_rx_status == UART_RECIEVE_IDLE))
    {
        uart_rx_status = UART_RECIEVED_STX;
    }
    else if ((rx_ch == '0') && (uart_rx_status == UART_RECIEVED_STX))
    {
        uart_rx_status = UART_RECIEVED_0;
    }
    else if (uart_rx_status == UART_RECIEVED_0)
    {
        //indicate thermometer stated
        id_ch = rx_ch;
        id_num = id_ch - 48;
        indicate_dev(id_num);
        if (id_num % 2)
        {
            indicate_led_on();
        }
        else
        {
            indicate_led_off();
        }
        uart_rx_status = UART_RECIEVED_ID;
    }
    else if ((rx_ch == UART_ETX) && (uart_rx_status == UART_RECIEVED_ID))
    {
        uart_rx_status = UART_RECIEVE_IDLE;
    }
    else
    {
        // there has been an issue in  UART, reset to idle
        uart_rx_status = UART_RECIEVE_IDLE;
    }
}

static void uart_put_coded_val(uint8_t val)
{
    if (val < 10)
    {
        app_uart_put(0x30 + val); //send the ascii value of the number (0-9)
    }
    else
    {
        app_uart_put(0x41 + val - 10); //send the ascii value of the number (A-F)
    }
}

static void tx_temp_byte(uint8_t byte)
{
    if (latest_temp[byte/2].id == (byte/2))
    {
        if (byte % 2)
        {
            uint8_t lower = latest_temp[byte/2].temp & 0x0F;
            uart_put_coded_val(lower);
        }
        else
        {
            uint8_t upper = (latest_temp[byte/2].temp & 0xF0) >> 4;
            uart_put_coded_val(upper);
        }
    }
    else
    {
        // sending FF indicates no connection
        app_uart_put(0x46);
    }
}

static void uart_tx_empty_handler(void)
{
    //uart_tx_status = UART_TX_IDLE;
    static uint8_t i = 0;
            
    if (i < 20)
    {
        tx_temp_byte(i);
        i++;
    }
    else if (i == 20)
    {
        app_uart_put(UART_ETX);
        i++;
    }
    else
    {
        i=0;
    }
}

static void uart_evt_handler(app_uart_evt_t * p_app_uart_event)
{
    switch (p_app_uart_event->evt_type)
    {
        case APP_UART_DATA_READY:
        {
            uart_data_rx_handler();
        } break;
        case APP_UART_FIFO_ERROR:
        {
            
        } break;
        case APP_UART_COMMUNICATION_ERROR:
        {
            
        } break;
        case APP_UART_TX_EMPTY:
        {
            uart_tx_empty_handler();
        } break;
        case APP_UART_DATA:
        {
            
        } break;
    }
}

static void uart_tx_timeout_handler(void * p_context)
{
    static bool on = true;
    if (on)
    {
        indicate_led_off();
        on = false;
    }
    else
    {
        indicate_led_on();
        on = true;
    }
    app_uart_put(UART_STX);
    /*    uint8_t data_send[] = {UART_STX, 0x32, 0x30, 0x32, 0x33, 0x34, 0x35, 0x30, 0x30, 0x30, 0x30, 0x30, 0x30, 0x30, 0x30, 0x30, 0x30, 0x30, 0x30, 0x30, 0x30, UART_ETX};

