Callum-Sinclair/nrf51_pi_house_monitor/nrf_pi_extention/BLE_central/ble_central_and_peripheral/experimental/ble_app_hrs_rscs_relay/main.c
void uart_init(void)
{
    uint32_t err_code;
    const app_uart_comm_params_t comm_params =
      {
          10,
          9,
          RTS_PIN_NUMBER,
          RTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_DISABLED,
          false,
          UART_BAUDRATE_BAUDRATE_Baud9600
      };

    APP_UART_FIFO_INIT(&comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_evt_handler,
                         APP_IRQ_PRIORITY_LOW,
                         err_code);
    APP_ERROR_CHECK(err_code);
}
#include "nrf_delay.h"
/** @brief Function to sleep until a BLE event is received by the application.
 */
static void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
    if (debug_trigger())
    {
        indicate_dev(0);
    }
}


int main(void)
{
    ret_code_t err_code;
    bool       erase_bonds;

    //err_code = NRF_LOG_INIT();
    //APP_ERROR_CHECK(err_code);

    //NRF_LOG_PRINTF("Relay Example\r\n");

    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);
    // Create uart timer
    err_code = app_timer_create(&m_uart_tx_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                uart_tx_timeout_handler);
    APP_ERROR_CHECK(err_code);
    
    err_code = app_timer_start(m_uart_tx_timer_id, UART_TX_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
    
    //buttons_leds_init(&erase_bonds);
//    connections_log_init();
    indicate_led_init();
    indicate_led_on();
    debug_pin_init();
    uart_init();
    if (erase_bonds == true)
    {
        //NRF_LOG("Bonds erased!\r\n");
    }

    ble_stack_init();

    peer_manager_init(erase_bonds);

    db_discovery_init();
    rscs_c_init();

    gap_params_init();
    conn_params_init();
    services_init();
    advertising_init();

    /** Start scanning for peripherals and initiate connection to devices which
     *  advertise Heart Rate or Running speed and cadence UUIDs. */
    scan_start();

    // Turn on the LED to signal scanning.
    //LEDS_ON(CENTRAL_SCANNING_LED);

    // Start advertising.
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    app_uart_put(0);
    for (;;)
    {
        //uart_tx_temps();
        //nrf_delay_ms(10);
        // Wait for BLE events.
        power_manage();
    }
}
